INSERT INTO movies (title, genre, duration_min, age_rating) VALUES
('Интерстеллар', 'Фантастика', 169, '12+'),
('Матрица', 'Фантастика', 136, '16+'),
('Гарри Поттер и философский камень', 'Фэнтези', 152, '12+'),
('Дракула', 'Ужасы', 135, '18+'),
('Аватар', 'Фантастика', 162, '12+');


INSERT INTO halls (name, capacity) VALUES
('Зал 1', 50),
('Зал 2', 80),
('Зал 3', 100),
('VIP-зал', 20),
('Малый зал', 30);


INSERT INTO customers (first_name, last_name, patronymic, phone) VALUES
('Иван', 'Петров', 'Сергеевич', '+79001112233'),
('Мария', 'Сидорова', 'Алексеевна', '+79004445566'),
('Алексей', 'Иванов', 'Павлович', '+79007778899'),
('Ольга', 'Кузнецова', 'Игоревна', '+79005556677'),
('Дмитрий', 'Смирнов', 'Александрович', '+79002223344');


INSERT INTO screenings (movie_id, hall_id, starts_at) VALUES
(1, 1, '2025-09-20 19:00'),
(2, 2, '2025-09-20 20:30'),
(3, 3, '2025-09-21 18:00'),
(4, 5, '2025-09-21 15:00'),
(5, 4, '2025-09-22 21:00');


INSERT INTO tickets (screening_id, customer_id, seat_row, seat_num, price, sold_at) VALUES
(1, 1, 1, 5, 500.00, '2025-09-15 10:00'),
(1, 2, 1, 6, 500.00, '2025-09-15 10:05'),
(2, 3, 2, 8, 600.00, '2025-09-16 12:30'),
(3, 4, 3, 10, 450.00, '2025-09-16 14:20'),
(4, 5, 1, 1, 1000.00, '2025-09-17 09:15');